Voorbeeldberichten/uitgifteservice/07_DO_Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchDataRequest
                xmlns="http://www.broservices.nl/xsd/dsepc/1.0"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepc/1.0 https://raw.githubusercontent.com/BROprogramma/EPC/master/XSD/dsepc-messages.xsd">
            <!--Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de innameservice.
                Het is niet gevalideert door de innameservice en is vaktechnisch/inhoudelijk niet voorbeeldig.
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepc/1.0 https://schema.broservices.nl/xsd/dsepc/1.0/dsepc-messages.xsd">
            -->
            <brocom:requestReference>uitgifte-objectgegevens</brocom:requestReference>
            <brocom:broId>EPC123456789012</brocom:broId>
            <dataToBeDelivered>actueelHistorisch</dataToBeDelivered>
        </dispatchDataRequest>
    </soap:Body>
</soap:Envelope>
